[
  {
    "options": [
      "The item was packaged in bubble wrap. This happened because It was fragile..",
      "The item was packaged in bubble wrap. This happened because It was small.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I emptied my pockets. As a result, I retrieved a ticket stub..",
      "I emptied my pockets. As a result, I found a weapon.."
    ],
    "answer": 0
  },
  {
    "options": [
      "Termites invaded the house. As a result, The termites disappeared from the house..",
      "Termites invaded the house. As a result, The termites ate through the wood in the house.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The travelers reached the border. As a result, The patrol agent checked their passports..",
      "The travelers reached the border. As a result, The patrol agent accused them of smuggling.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The office was closed. This happened because It was a holiday..",
      "The office was closed. This happened because It was summer.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The girl ran out of energy. This happened because She played checkers..",
      "The girl ran out of energy. This happened because She jumped rope.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The woman lost her place in line. This happened because More people entered the line..",
      "The woman lost her place in line. This happened because She stepped out of the line.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The girl pinched her nose. This happened because The baby drooled on her bib..",
      "The girl pinched her nose. This happened because The baby soiled her diaper.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The band played their hit song. As a result, The audience clapped along to the music..",
      "The band played their hit song. As a result, The audience politely listened in silence.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The girl wanted to thank her math teacher. As a result, The girl stayed after school for detention..",
      "The girl wanted to thank her math teacher. As a result, The girl brought the teacher an apple.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The young campers felt scared. This happened because Their camp counselor told them a ghost story..",
      "The young campers felt scared. This happened because They toasted marshmallows on the campfire.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man hit his head. As a result, He got lost in thought..",
      "The man hit his head. As a result, He got a concussion.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The check I wrote bounced. This happened because My bank account was empty..",
      "The check I wrote bounced. This happened because I earned a pay raise.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man's email inbox was full of spam. As a result, He deleted the spam..",
      "The man's email inbox was full of spam. As a result, He sent out a mass email.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The sailor was quarantined. This happened because He was exposed to the disease..",
      "The sailor was quarantined. This happened because He recovered from the disease.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The girl memorized the code. This happened because She recited it to herself..",
      "The girl memorized the code. This happened because She forgot to write it down.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I poured the water into the glass. As a result, The water quenched my thirst..",
      "I poured the water into the glass. As a result, The glass became full.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man remained silent when his friend finishing speaking. This happened because He wanted to offer his friend support..",
      "The man remained silent when his friend finishing speaking. This happened because He was thinking about his friend's words.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The accident was my fault. As a result, I felt guilty..",
      "The accident was my fault. As a result, I pressed charges.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The chain came apart. This happened because The chain was wrapped around a tire..",
      "The chain came apart. This happened because There was a broken link in the chain.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The couple decided to compromise. This happened because They grew tired of arguing..",
      "The couple decided to compromise. This happened because They avoided discussing the problem.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman decided to run for public office. As a result, She hired a campaign manager..",
      "The woman decided to run for public office. As a result, She testified in court.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man anticipated cold weather on his trip. As a result, He packed warm clothing in his suitcase..",
      "The man anticipated cold weather on his trip. As a result, He travelled with a big suitcase.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The student knew the answer to the question. As a result, He raised his hand..",
      "The student knew the answer to the question. As a result, He goofed off.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man's eyes watered. This happened because Dust got into his eyes..",
      "The man's eyes watered. This happened because He put goggles over his eyes.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The player won five games in a row. As a result, Her opponent accused her of cheating..",
      "The player won five games in a row. As a result, Her opponent felt sorry for her.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The teacher tore up the student's exam. This happened because He caught the student cheating..",
      "The teacher tore up the student's exam. This happened because The student's answers were incorrect.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I paused to stop talking. This happened because I lost my voice..",
      "I paused to stop talking. This happened because I ran out of breath.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The frozen food thawed. This happened because I put it in the microwave..",
      "The frozen food thawed. This happened because I covered it with plastic wrap.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The employee faked sick. This happened because He had stomach cramps..",
      "The employee faked sick. This happened because He wanted a day off.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The girl landed in the pool. This happened because She ran on the pool deck..",
      "The girl landed in the pool. This happened because She jumped off the diving board.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The movie tickets sold out. This happened because It was opening day for the movie..",
      "The movie tickets sold out. This happened because The movie received poor reviews.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man lost weight. As a result, People isolated him..",
      "The man lost weight. As a result, People complimented him.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The girl's hands became blistered. This happened because She typed up a letter..",
      "The girl's hands became blistered. This happened because She climbed up a rope.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The circus performer juggled while riding a unicycle. As a result, The audience cheered in astonishment..",
      "The circus performer juggled while riding a unicycle. As a result, The acrobat swung from a trapeze.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I lost my patience. This happened because My friend kept me waiting..",
      "I lost my patience. This happened because My friend arrived on time.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The warring countries wanted peace. As a result, They developed nuclear weapons..",
      "The warring countries wanted peace. As a result, They negotiated a treaty.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man took sleeping medication. As a result, He became drowsy..",
      "The man took sleeping medication. As a result, He ran a fever.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman bumped into the sofa. As a result, The leg of the sofa came loose..",
      "The woman bumped into the sofa. As a result, She bruised her knee.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The boy squeezed the balloon. As a result, The balloon popped..",
      "The boy squeezed the balloon. As a result, The balloon flew away.."
    ],
    "answer": 0
  },
  {
    "options": [
      "They travelers checked into their hotel room. As a result, They unpacked their suitcases..",
      "They travelers checked into their hotel room. As a result, They went to the airport.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I bit into the peach. As a result, The peach bruised..",
      "I bit into the peach. As a result, Juice spilled out.."
    ],
    "answer": 1
  },
  {
    "options": [
      "My hands became sticky. This happened because I ate a doughnut..",
      "My hands became sticky. This happened because I had a sweet tooth.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I pushed the door. As a result, The door opened..",
      "I pushed the door. As a result, The door locked.."
    ],
    "answer": 0
  },
  {
    "options": [
      "Activists boycotted the products. This happened because The products were tested for quality assurance..",
      "Activists boycotted the products. This happened because The products were manufactured through child labor.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I drilled a hole in the wall. As a result, A mouse crawled out of the hole..",
      "I drilled a hole in the wall. As a result, Dust blew out of the hole.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The woman felt envious of her sister. This happened because Her sister was happy..",
      "The woman felt envious of her sister. This happened because Her sister got divorced.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I spilled wine on my shirt. As a result, I put on an apron..",
      "I spilled wine on my shirt. As a result, I changed my shirt.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The cashier opened the cash register. This happened because The customer searched his wallet..",
      "The cashier opened the cash register. This happened because The customer handed her money.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The street musician attracted a crowd. As a result, People gave him change..",
      "The street musician attracted a crowd. As a result, He sent the crowd away.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The little boy cried to his babysitter. This happened because He missed his parents..",
      "The little boy cried to his babysitter. This happened because It was snack time.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The pilot's radar detected a storm. As a result, The pilot navigated away from the storm..",
      "The pilot's radar detected a storm. As a result, The pilot flew through the storm.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The tree shed its leaves. As a result, The leaves turned colors..",
      "The tree shed its leaves. As a result, The leaves accumulated on the ground.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The boy was in a mischievous mood. As a result, He decided to play a card game with his sister..",
      "The boy was in a mischievous mood. As a result, He decided to play a practical joke on his sister.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The child complained that he had to go to the bathroom. As a result, His father gave him a soda to drink..",
      "The child complained that he had to go to the bathroom. As a result, His father stopped the car at a gas station.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The child sprinkled fish food into the tank. As a result, The fish leapt out of the tank..",
      "The child sprinkled fish food into the tank. As a result, The fish swam towards the food.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The woman's political views changed. As a result, She switched her party affiliation..",
      "The woman's political views changed. As a result, She engaged in a protest.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The bathroom sink was clogged. As a result, I turned on the faucet..",
      "The bathroom sink was clogged. As a result, I poured drain cleaner into it.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The passengers got off the train. This happened because The train arrived at the station..",
      "The passengers got off the train. This happened because The train blared its whistle.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man pressed down on the moist flap of the envelope. As a result, He put a stamp on the envelope..",
      "The man pressed down on the moist flap of the envelope. As a result, He sealed the envelope shut.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The friends lost touch. This happened because They enjoyed each other's company..",
      "The friends lost touch. This happened because They moved to different cities.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The accountant mismanaged the company's funds. As a result, She was fired from her position..",
      "The accountant mismanaged the company's funds. As a result, She went on maternity leave.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I looked at the clock. This happened because I heard the clock tick..",
      "I looked at the clock. This happened because I wanted to check the time.."
    ],
    "answer": 1
  },
  {
    "options": [
      "My hand cramped up. This happened because I wrote the essay by hand..",
      "My hand cramped up. This happened because My wife and I held hands.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The bolt tightened. This happened because I replaced the bolt..",
      "The bolt tightened. This happened because I twisted the wrench.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The couple signed a lease for an apartment. As a result, The couple moved into the apartment..",
      "The couple signed a lease for an apartment. As a result, The city condemned the apartment.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman sat outside on the porch. This happened because She wanted to watch the sunset..",
      "The woman sat outside on the porch. This happened because She thought she saw lightning.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man wore a lifejacket in the water. This happened because He couldn't swim..",
      "The man wore a lifejacket in the water. This happened because The water was shallow.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman made a typo in the word processor. As a result, She deleted the document..",
      "The woman made a typo in the word processor. As a result, She hit the backspace key.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The girl bragged to her friends. This happened because She got a bad grade..",
      "The girl bragged to her friends. This happened because She won a contest.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The lawn was muddy. This happened because It poured overnight..",
      "The lawn was muddy. This happened because It was full of weeds.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman overslept. This happened because She stayed the night in a hotel..",
      "The woman overslept. This happened because She forgot to set her alarm clock.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man put on sunscreen. This happened because He sat in the shade..",
      "The man put on sunscreen. This happened because He went to the beach.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The researchers proved the theory. As a result, The researchers retracted the theory..",
      "The researchers proved the theory. As a result, Individuals accepted the theory.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The fans at the game booed. This happened because The game went into overtime..",
      "The fans at the game booed. This happened because The referee made a bad call.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I entered my combination on the lock. As a result, I shut the lock..",
      "I entered my combination on the lock. As a result, The lock popped open.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The crowd intensified. As a result, The father handed his son some money..",
      "The crowd intensified. As a result, The father grabbed his son's hand.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The snow was blocking the driveway. As a result, I gathered the snow into a snowball..",
      "The snow was blocking the driveway. As a result, I shoveled the snow out of the way.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The kayakers paddled their oars. As a result, The kayak reached the shore..",
      "The kayakers paddled their oars. As a result, The kayak hit a wave.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The girl lost control of her bike. As a result, She let go of the handlebars..",
      "The girl lost control of her bike. As a result, She crashed into a fence.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I turned on the fan. As a result, Water sprinkled onto my skin..",
      "I turned on the fan. As a result, I felt cool air pass over me.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The surfers returned to the beach. This happened because They were drenched..",
      "The surfers returned to the beach. This happened because They saw a shark.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I pulled the drain plug in the bathtub. As a result, The water drained out of the tub..",
      "I pulled the drain plug in the bathtub. As a result, The water splashed onto the floor.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The husband felt guilty about cheating on his wife. As a result, He accused her of infidelity..",
      "The husband felt guilty about cheating on his wife. As a result, He confessed his infidelity to her.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The ink on the poster smeared. This happened because I waited for the ink to dry..",
      "The ink on the poster smeared. This happened because I spilled water on the poster.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The child woke up screaming. This happened because He had a nightmare..",
      "The child woke up screaming. This happened because He wet the bed.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The boy put his feet up on the table. As a result, His father sat down at the table..",
      "The boy put his feet up on the table. As a result, His father lectured him.."
    ],
    "answer": 1
  },
  {
    "options": [
      "My friend turned his head in my direction. This happened because I shouted his name..",
      "My friend turned his head in my direction. This happened because I waved my arms.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The government oppressed its citizens. As a result, The citizens staged a revolt..",
      "The government oppressed its citizens. As a result, The citizens registered to vote.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The boy was lost in the woods. As a result, He pitched a tent..",
      "The boy was lost in the woods. As a result, He screamed for help.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The woman travelled abroad. This happened because She wanted to learn how to draw..",
      "The woman travelled abroad. This happened because She wanted to learn about other cultures.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man was jealous of his coworker. This happened because His coworker got a promotion..",
      "The man was jealous of his coworker. This happened because His coworker worked late.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man witnessed aliens. This happened because He was hallucinating..",
      "The man witnessed aliens. This happened because He was meditating.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man's hair turned blonde. This happened because He put bleach in it..",
      "The man's hair turned blonde. This happened because He put shampoo in it.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The artist created new work. This happened because She critiqued her previous work..",
      "The artist created new work. This happened because She felt a stroke of inspiration.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The son moved away from home. This happened because He was discharged from the military..",
      "The son moved away from home. This happened because He was going to college.."
    ],
    "answer": 1
  },
  {
    "options": [
      "Books fell out of the bookcase. This happened because The shelves were covered with dust..",
      "Books fell out of the bookcase. This happened because An earthquake shook the bookcase.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The electricity in my house shut off. As a result, I turned on a light..",
      "The electricity in my house shut off. As a result, I reset the circuit breaker.."
    ],
    "answer": 1
  },
  {
    "options": [
      "We rode the roller coaster. This happened because It looked scary..",
      "We rode the roller coaster. This happened because It looked fun.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The bag of popcorn began to pop. This happened because I poured butter into the bag..",
      "The bag of popcorn began to pop. This happened because I heated it in the microwave.."
    ],
    "answer": 1
  },
  {
    "options": [
      "A tree fell on the power line. As a result, The electricity in the neighborhood went out..",
      "A tree fell on the power line. As a result, The forecast predicted heavy winds.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The speaker made politically incorrect comments. As a result, He bored the audience..",
      "The speaker made politically incorrect comments. As a result, He offended the audience.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I pricked myself with the pin. As a result, A bead of sweat dripped from my face..",
      "I pricked myself with the pin. As a result, A drop of blood formed on my finger.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The fish floated on the surface of the tank. This happened because It was hungry..",
      "The fish floated on the surface of the tank. This happened because It was dead.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man's voice sounded hoarse. This happened because He had a cold..",
      "The man's voice sounded hoarse. This happened because He quit smoking.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The elevator doors opened. This happened because The elevator arrived at the designated floor..",
      "The elevator doors opened. This happened because The elevator got stuck between floors.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The teenager snuck out of the house. This happened because He lied to his parents..",
      "The teenager snuck out of the house. This happened because His parents grounded him.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The bathroom flooded. This happened because The toilet overflowed..",
      "The bathroom flooded. This happened because The water heater broke.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The puppy stayed near its owner. This happened because The owner put a collar on the puppy..",
      "The puppy stayed near its owner. This happened because The owner kept the puppy on a leash.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man caught his reflection. This happened because He stood under the sprawling tree..",
      "The man caught his reflection. This happened because He stood over the calm lake.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I missed my girlfriend's phone call. As a result, I called her back..",
      "I missed my girlfriend's phone call. As a result, I met her for dinner.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The family searched the neighborhood. This happened because Their dog ran away from home..",
      "The family searched the neighborhood. This happened because Expensive jewelry was missing from their home.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I saw my breath when I exhaled. This happened because The weather was chilly..",
      "I saw my breath when I exhaled. This happened because My chest felt tight.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The employees formed a union. This happened because They wanted better working conditions..",
      "The employees formed a union. This happened because Their employer raised their wages.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I baked an apple pie. As a result, A rotting smell filled the kitchen..",
      "I baked an apple pie. As a result, A warm aroma filled the kitchen.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The woman struggled to walk. This happened because She wore high heels..",
      "The woman struggled to walk. This happened because She took off her shoes.."
    ],
    "answer": 0
  },
  {
    "options": [
      "Steam rose off of the pot of water. This happened because The water boiled..",
      "Steam rose off of the pot of water. This happened because I covered the pot.."
    ],
    "answer": 0
  },
  {
    "options": [
      "All my socks were in the laundry. As a result, I wore sandals..",
      "All my socks were in the laundry. As a result, I wore boots.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The politician's argument was considered absurd. As a result, He lost the support of voters..",
      "The politician's argument was considered absurd. As a result, He was accused of corruption.."
    ],
    "answer": 0
  },
  {
    "options": [
      "Everyone disapproved of the couple's engagement. As a result, The couple got pregnant..",
      "Everyone disapproved of the couple's engagement. As a result, The couple eloped.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The building was dedicated to the millionaire. This happened because The millionaire wanted the building torn down..",
      "The building was dedicated to the millionaire. This happened because The millionaire contributed the funds to build it.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The sale associate accused the girl of stealing. This happened because The sales associate saw the girl put merchandise in her purse..",
      "The sale associate accused the girl of stealing. This happened because The sales associate helped the girl find the purse she liked.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The country declared war on the neighboring territory. As a result, Soldiers were sent out to fight..",
      "The country declared war on the neighboring territory. As a result, Soldiers were reunited with their families.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The court upheld the controversial ruling. As a result, A riot broke loose in front of the courthouse..",
      "The court upheld the controversial ruling. As a result, A couple exchanged vows in front of the courthouse.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The girl smelled something burning. This happened because She took the cookies out of the jar..",
      "The girl smelled something burning. This happened because She left the cookies in the oven.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The rain was pouring down. As a result, The storm worsened..",
      "The rain was pouring down. As a result, I dashed to get inside.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The building was evacuated. This happened because The elevator stopped functioning..",
      "The building was evacuated. This happened because The fire alarm went off.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The father resented his son's alcoholism. As a result, The father bought his son a beer..",
      "The father resented his son's alcoholism. As a result, The father kicked his son out of the house.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The lawyer took the stairs up to her office. This happened because The secretary went home for the day..",
      "The lawyer took the stairs up to her office. This happened because The elevator was out of order.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man became annoyed with his friend. This happened because His friend interrupted him..",
      "The man became annoyed with his friend. This happened because His friend bought him lunch.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The girl handed her money to the cashier. As a result, The cashier gave the girl her change..",
      "The girl handed her money to the cashier. As a result, The cashier forgot to give the girl a receipt.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman was put in a wheelchair. This happened because She was paralyzed in an accident..",
      "The woman was put in a wheelchair. This happened because She entered the hospital in a stretcher.."
    ],
    "answer": 0
  },
  {
    "options": [
      "Citizens hung the national flag up outside their homes. This happened because The country was commemorating its independence..",
      "Citizens hung the national flag up outside their homes. This happened because The country was facing economic hardship.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The team lost the tournament. As a result, They disappointed their fans..",
      "The team lost the tournament. As a result, They inspired their fans.."
    ],
    "answer": 0
  },
  {
    "options": [
      "My friend pointed out that I had food stuck in my teeth. As a result, I felt embarrassed..",
      "My friend pointed out that I had food stuck in my teeth. As a result, I felt proud.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The boy failed his history exam. This happened because He paid attention in class..",
      "The boy failed his history exam. This happened because He forgot to study.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The downtown building collapsed. This happened because An earthquake hit the city..",
      "The downtown building collapsed. This happened because Crime rates in the city increased.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man's girlfriend broke up with him. As a result, He begged her to take him back..",
      "The man's girlfriend broke up with him. As a result, She introduced him to her parents.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The two children simultaneously reached down to retrieve the ball. As a result, The ball rolled away..",
      "The two children simultaneously reached down to retrieve the ball. As a result, Their heads collided.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The raccoon ransacked the garbage can. This happened because There was cardboard in the garbage can..",
      "The raccoon ransacked the garbage can. This happened because The lid was off the garbage can.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The boy sharpened the pencil. This happened because It was cheap..",
      "The boy sharpened the pencil. This happened because It was dull.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The cashier denied the woman a refund for the dress. This happened because She lost her receipt..",
      "The cashier denied the woman a refund for the dress. This happened because The dress didn't fit.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The scratch in my skin was deep. As a result, It healed quickly..",
      "The scratch in my skin was deep. As a result, It left a scar.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man received strange looks from passengers on the train. This happened because He was staring at the ground..",
      "The man received strange looks from passengers on the train. This happened because He was talking to himself.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The child left crumbs on the floor. As a result, Ants crawled to the crumbs..",
      "The child left crumbs on the floor. As a result, The child put the bread away.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman handed her sister a tissue. This happened because The woman's sister folded her hands..",
      "The woman handed her sister a tissue. This happened because The woman's sister began to cry.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man took a mint. This happened because His lips were chapped..",
      "The man took a mint. This happened because He worried about bad breath.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The couple left early for the show. This happened because They anticipated traffic around the theatre..",
      "The couple left early for the show. This happened because They got directions to the theatre.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman stayed home from work. As a result, Her boss praised her..",
      "The woman stayed home from work. As a result, Her coworker covered for her.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man signed the activists' petition. This happened because He supported their cause..",
      "The man signed the activists' petition. This happened because He denounced them as crazy.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The actor's heart was fluttering before his performance. This happened because He had stage fright..",
      "The actor's heart was fluttering before his performance. This happened because He memorized his lines.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I was lost. As a result, I counted my cash..",
      "I was lost. As a result, I unfolded a map.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The ripe fruit lingered in the sun. As a result, It was eaten..",
      "The ripe fruit lingered in the sun. As a result, It shriveled up.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The car broke down. This happened because I turned the ignition..",
      "The car broke down. This happened because The engine overheated.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man hurt his back. As a result, He went to see a psychiatrist..",
      "The man hurt his back. As a result, He stayed in bed for several days.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I started a fire in the fireplace. This happened because I was out of firewood..",
      "I started a fire in the fireplace. This happened because It was cold in the house.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The woman stopped jogging. This happened because She got a cramp in her side..",
      "The woman stopped jogging. This happened because She got a second wind.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I knocked on my neighbor's door. As a result, My neighbor invited me in..",
      "I knocked on my neighbor's door. As a result, My neighbor left her house.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman sighed with frustration. This happened because Her husband misunderstood her concerns..",
      "The woman sighed with frustration. This happened because Her husband kissed her goodbye.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The teacher commended the student. This happened because The student answered the question correctly..",
      "The teacher commended the student. This happened because The student hesitated to answer the question.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman ran out of eggs. As a result, She went to the farm..",
      "The woman ran out of eggs. As a result, She went to the supermarket.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I encountered an old friend. As a result, I revealed a secret to him..",
      "I encountered an old friend. As a result, I gave him a hug.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The woman avoided going in the lake. This happened because She caught a fish..",
      "The woman avoided going in the lake. This happened because It looked contaminated.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The student arrived to class soaking wet. This happened because His umbrella was broken..",
      "The student arrived to class soaking wet. This happened because His bike was stolen.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The cursor on the computer screen moved. This happened because The user clicked the mouse..",
      "The cursor on the computer screen moved. This happened because The user shifted the mouse.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The driver took a detour. This happened because An accident occurred on the main road..",
      "The driver took a detour. This happened because She followed the truck in front of her.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I hung the wet linen on the outdoor clothesline. As a result, The linen dried..",
      "I hung the wet linen on the outdoor clothesline. As a result, The linen stained.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman put on her shades. This happened because The sunlight was bright..",
      "The woman put on her shades. This happened because She hailed a cab.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man gazed at the night sky. This happened because He wished it were summer..",
      "The man gazed at the night sky. This happened because He thought it was beautiful.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I felt exhausted. As a result, I went to bed early..",
      "I felt exhausted. As a result, I stayed up all night.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man went to the barber. This happened because He was growing out his hair..",
      "The man went to the barber. This happened because His hair was getting long.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The boy played mean tricks on his new classmate. This happened because The boy welcomed the new classmate..",
      "The boy played mean tricks on his new classmate. This happened because The boy disliked the new classmate.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I craved a glass of milk. This happened because I was eating cookies..",
      "I craved a glass of milk. This happened because I was baking bread.."
    ],
    "answer": 0
  },
  {
    "options": [
      "It began to rain. As a result, The driver turned on the headlights..",
      "It began to rain. As a result, The driver shifted the car into reverse.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The parking lot of the building was empty. As a result, I parked across the street..",
      "The parking lot of the building was empty. As a result, I parked near the entrance.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The writer missed her deadline for the draft submission. This happened because She had writer's block..",
      "The writer missed her deadline for the draft submission. This happened because She edited the draft.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The associate hung up on me. This happened because I asked to speak to a supervisor..",
      "The associate hung up on me. This happened because I provided my identification number.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The wind blew through the open window. As a result, The doorbell rang..",
      "The wind blew through the open window. As a result, The curtains shuddered.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The electricity in my house shut off. This happened because I unplugged the lamp..",
      "The electricity in my house shut off. This happened because I blew a fuse.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The weightlifter grunted. This happened because He flexed his muscles in the mirror..",
      "The weightlifter grunted. This happened because He lifted the bar over his head.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The student tried to do the math in his head. As a result, He got out a calculator..",
      "The student tried to do the math in his head. As a result, He got confused.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The baby fell asleep. This happened because The father changed the baby's diaper..",
      "The baby fell asleep. This happened because The father gently rocked the baby.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The girl threw the water balloon at the boy. As a result, The boy got a concussion..",
      "The girl threw the water balloon at the boy. As a result, The boy got soaked.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The photographer forgot to use the flash on the camera. As a result, The photos turned out blurry..",
      "The photographer forgot to use the flash on the camera. As a result, Everyone in the photos refused to smile.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I declined the invitation to the birthday party. This happened because I was lonely..",
      "I declined the invitation to the birthday party. This happened because I was out of town.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I exercised. This happened because I felt energetic..",
      "I exercised. This happened because I was scared.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I squeezed the damp sponge. As a result, It soaked up water..",
      "I squeezed the damp sponge. As a result, Water seeped out of it.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The vacationers took a ferry to the resort. This happened because The resort was booked..",
      "The vacationers took a ferry to the resort. This happened because The resort was on an island.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The teenager got a tattoo. This happened because She was afraid of needles..",
      "The teenager got a tattoo. This happened because She wanted to rebel.."
    ],
    "answer": 1
  },
  {
    "options": [
      "An unfamiliar car parked outside my house. As a result, I became suspicious..",
      "An unfamiliar car parked outside my house. As a result, I called the police.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The criminal turned himself in. This happened because The evidence implicated him..",
      "The criminal turned himself in. This happened because  There was no evidence against him.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The heavyset man decided to lose weight. As a result, He cut out sweets..",
      "The heavyset man decided to lose weight. As a result, He avoided caffeine.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The girl stepped on the ice. As a result, She slid..",
      "The girl stepped on the ice. As a result, She shivered.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman had rings under her eyes. This happened because She stayed up all night..",
      "The woman had rings under her eyes. This happened because She put her son to bed.."
    ],
    "answer": 0
  },
  {
    "options": [
      "Lava flowed from the volcano. This happened because The volcano erupted..",
      "Lava flowed from the volcano. This happened because The volcano was dormant.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman put her shoes on. This happened because She knew everyone at the party..",
      "The woman put her shoes on. This happened because She wanted to leave the party.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I paid the tollbooth attendant. As a result, She let me pass through the tollbooth..",
      "I paid the tollbooth attendant. As a result, She detained me at the tollbooth.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The executive went bankrupt. This happened because He sold his company stock..",
      "The executive went bankrupt. This happened because He squandered his fortune.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man went to the doctor. This happened because The doctor was on leave..",
      "The man went to the doctor. This happened because The man felt ill.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I exited my bedroom through the window. This happened because The house was on fire..",
      "I exited my bedroom through the window. This happened because The house was empty.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The boy's fingers became pruny. This happened because He took a long shower..",
      "The boy's fingers became pruny. This happened because He lathered his hands with soap.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I spit out the milk. This happened because The milk tasted sour..",
      "I spit out the milk. This happened because My mouth was dry.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I missed the bus. As a result, I was early to work..",
      "I missed the bus. As a result, I was late to work.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The truck collided with the car. As a result, The truck sped up..",
      "The truck collided with the car. As a result, The car got smashed.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The team rigged the contest in their favor. As a result, They won..",
      "The team rigged the contest in their favor. As a result,  They dropped out.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The soda bottle hissed. This happened because I turned over the bottle..",
      "The soda bottle hissed. This happened because I twisted off the cap.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The boy was locked out of his house. As a result, He crawled in through an open window..",
      "The boy was locked out of his house. As a result, He climbed up to the roof.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The doorbell rang. As a result, The visitor tapped the knocker on the door..",
      "The doorbell rang. As a result, The woman peered through the keyhole in the door.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man stained his suit. As a result, He got it dry-cleaned..",
      "The man stained his suit. As a result, He hung it in his closet.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The girl squeezed the tube of toothpaste. As a result, The toothpaste squirted out of the tube..",
      "The girl squeezed the tube of toothpaste. As a result, The girl spit out the toothpaste.."
    ],
    "answer": 0
  },
  {
    "options": [
      "Civilian deaths from the war surged. As a result, Pacifists staged a protest..",
      "Civilian deaths from the war surged. As a result, Pacifists held a parade.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The girl yanked the ribbon out of her hair. This happened because She tied the ribbon..",
      "The girl yanked the ribbon out of her hair. This happened because The ribbon looked babyish.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man got plastic surgery. As a result, He aged..",
      "The man got plastic surgery. As a result, He looked younger.."
    ],
    "answer": 1
  },
  {
    "options": [
      "A baby chicken emerged from the egg. This happened because The egg hatched..",
      "A baby chicken emerged from the egg. This happened because I cracked the egg.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The prisoner starved. As a result, He died..",
      "The prisoner starved. As a result, He fled.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man lost his balance on the ladder. As a result, He climbed up the ladder..",
      "The man lost his balance on the ladder. As a result, He fell off the ladder.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The child burped. This happened because He took a swig of soda..",
      "The child burped. This happened because He opened the soda can.."
    ],
    "answer": 0
  },
  {
    "options": [
      "A cold draft came in through the window. As a result, I relaxed..",
      "A cold draft came in through the window. As a result, I shivered.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The student received a scholarship to go to college. This happened because Her classmates respected her..",
      "The student received a scholarship to go to college. This happened because She made good grades.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The girl poked fun at the boy. This happened because She lived next door to him..",
      "The girl poked fun at the boy. This happened because She had a crush on him.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The hungry vagrant stole food. This happened because He incited pity..",
      "The hungry vagrant stole food. This happened because He had no money.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I called my friend to chat. This happened because I wanted privacy..",
      "I called my friend to chat. This happened because I felt lonely.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man extended his hand to me. As a result, I shook his hand..",
      "The man extended his hand to me. As a result, I slapped him.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I ducked. This happened because The fireworks launched up in the air..",
      "I ducked. This happened because The frisbee soared towards my head.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The girl bit her nails. This happened because She was worried..",
      "The girl bit her nails. This happened because She was surprised.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I turned the page on the calendar. This happened because I marked an appointment on the calendar..",
      "I turned the page on the calendar. This happened because It was the beginning of a new month.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The husband discovered that his wife was having an affair. As a result, He fired his lawyer..",
      "The husband discovered that his wife was having an affair. As a result, He filed for divorce.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The girl dropped the rubber ball. As a result, The ball bounced..",
      "The girl dropped the rubber ball. As a result, The ball glowed.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The girl made a mistake on her exam. As a result, She guessed at the answer..",
      "The girl made a mistake on her exam. As a result, She erased her answer.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The player tackled his opponent. As a result, His opponent caught the pass..",
      "The player tackled his opponent. As a result, His opponent hit the ground.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I picked the tomatoes from the vine. This happened because They were ripe..",
      "I picked the tomatoes from the vine. This happened because I watered them.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man wanted to act romantic. As a result, He met his ex-girlfriend for lunch..",
      "The man wanted to act romantic. As a result, He bought his girlfriend chocolates.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The mercury in the thermometer rose. This happened because I dropped the thermometer..",
      "The mercury in the thermometer rose. This happened because The weather got warmer.."
    ],
    "answer": 1
  },
  {
    "options": [
      "A tornado came through the town. As a result, The roof of the courthouse blew off..",
      "A tornado came through the town. As a result, The highway became dangerously icy.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The student received tutoring. As a result, His grades improved..",
      "The student received tutoring. As a result, He cheated on the exam.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I felt comfortable. This happened because I kneeled down on the ground..",
      "I felt comfortable. This happened because I wrapped myself in a blanket.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I polished the stone. As a result, It became slippery..",
      "I polished the stone. As a result, It became shiny.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I added sugar to the coffee. As a result, The coffee smelled strong..",
      "I added sugar to the coffee. As a result, The coffee tasted sweet.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man shuffled through the papers. As a result, He got a paper cut..",
      "The man shuffled through the papers. As a result, He shredded the papers.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I pounded the nail with the hammer. As a result, The nail sunk into the wood..",
      "I pounded the nail with the hammer. As a result, The nail became rusty.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The fish bit the line. As a result, The fisherman reeled in the fish..",
      "The fish bit the line. As a result, The fisherman recast the line.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The teenager was embarrassed to go to school. This happened because She got a pimple..",
      "The teenager was embarrassed to go to school. This happened because She got her braces off.."
    ],
    "answer": 0
  },
  {
    "options": [
      "My facial expression lit up. This happened because I received good news..",
      "My facial expression lit up. This happened because I lost my patience.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I wiped my hands with a towel. This happened because The towel was wet..",
      "I wiped my hands with a towel. This happened because My hands were wet.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man lost his balance on the stool. This happened because The stool wobbled underneath him..",
      "The man lost his balance on the stool. This happened because He spilled paint on the stool.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The teammates directed blame at each other. This happened because They lost their game..",
      "The teammates directed blame at each other. This happened because Their coach cancelled practice.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I asked for forgiveness. This happened because I regretted my mistake..",
      "I asked for forgiveness. This happened because I achieved my goal.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman became bored with her date. This happened because He asked her questions about herself..",
      "The woman became bored with her date. This happened because He talked incessantly about himself.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The girl flashed a smile. As a result, Her cheeks reddened..",
      "The girl flashed a smile. As a result, Her dimples showed.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The enemy ship blew up. This happened because It passed over the mine..",
      "The enemy ship blew up. This happened because It sailed into the harbor.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man punctured his foot. This happened because He walked into a puddle..",
      "The man punctured his foot. This happened because He stepped on broken glass.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The detectives dusted the crime scene for fingerprints. As a result, They discovered the identity of the murderer..",
      "The detectives dusted the crime scene for fingerprints. As a result, They found the weapon at the crime scene.."
    ],
    "answer": 0
  },
  {
    "options": [
      "There was a lot of traffic on the highway. As a result, I took a detour..",
      "There was a lot of traffic on the highway. As a result, I asked for a ride.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The nation's economy declined. As a result, Many people got sick..",
      "The nation's economy declined. As a result, Many people faced unemployment.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The crossing guard blew her whistle at the children. This happened because They were about to walk into oncoming traffic..",
      "The crossing guard blew her whistle at the children. This happened because She recognized them from her neighborhood.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I rolled my eyes at my friend. This happened because He told me the truth..",
      "I rolled my eyes at my friend. This happened because He made a sarcastic remark.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The car ran out of gas. As a result, The driver was stranded on the road..",
      "The car ran out of gas. As a result, The driver picked up a hitchhiker.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman went into labor. As a result, The baby was delivered..",
      "The woman went into labor. As a result, The woman had morning sickness.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man's hat blew away. This happened because He took off the hat..",
      "The man's hat blew away. This happened because It was windy outside.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The girl attended her classmate's birthday party. This happened because She received an invitation..",
      "The girl attended her classmate's birthday party. This happened because She bought a gift.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The boy's forehead felt hot. As a result, His mother took his temperature..",
      "The boy's forehead felt hot. As a result, His mother took him to the park.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man sprayed himself with cologne. This happened because He wanted to impress his date..",
      "The man sprayed himself with cologne. This happened because He put gel in his hair.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The electricity in the house shut off. As a result, I looked for a flashlight..",
      "The electricity in the house shut off. As a result, I picked up a shovel.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The family moved into a bigger house. This happened because The son graduated from high school..",
      "The family moved into a bigger house. This happened because The mother gave birth to twins.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The marathoner kept at a slow pace. This happened because She wanted to conserve her energy..",
      "The marathoner kept at a slow pace. This happened because She saw the finish line.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The boy kicked the vending machine. This happened because The machine spit out the change..",
      "The boy kicked the vending machine. This happened because The bag of chips was stuck.."
    ],
    "answer": 1
  },
  {
    "options": [
      "My friend's dog died. As a result, I rolled my eyes at him..",
      "My friend's dog died. As a result, I gave him a hug.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The businessman's credit card got declined. As a result, He wrote an IOU..",
      "The businessman's credit card got declined. As a result, He paid with cash.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man cursed. This happened because He clipped his nails..",
      "The man cursed. This happened because He stubbed his toe.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man felt proud of his brother. This happened because His brother got in an argument with their parents..",
      "The man felt proud of his brother. This happened because His brother got accepted into law school.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The girl wanted to learn about the solar system. As a result, She went to the library..",
      "The girl wanted to learn about the solar system. As a result, She looked at the stars.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The poster stuck to the wall. This happened because I positioned the poster above the door..",
      "The poster stuck to the wall. This happened because I put tape on the back of the poster.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The client approved the architect's plans for the building. As a result, The architect constructed the building..",
      "The client approved the architect's plans for the building. As a result, The architect adjusted the plans.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man dropped his spoon. This happened because His hand was shaking..",
      "The man dropped his spoon. This happened because He licked the spoon.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The CEO of the company resigned. As a result, The board of directors dissolved the company..",
      "The CEO of the company resigned. As a result, The board of directors found his replacement.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I arrived late to the lecture. As a result, I took a seat in the back row..",
      "I arrived late to the lecture. As a result, I approached the podium.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man was released from jail. This happened because His family paid his bail..",
      "The man was released from jail. This happened because He attacked a fellow inmate.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The family lost all their belongings. This happened because They sold their house..",
      "The family lost all their belongings. This happened because Their house caught fire.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I stomped on the aluminum can. As a result, The can was recycled..",
      "I stomped on the aluminum can. As a result, The can got crushed.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The girl joined the debate team. As a result, She learned to use a computer..",
      "The girl joined the debate team. As a result, She learned communication skills.."
    ],
    "answer": 1
  },
  {
    "options": [
      "My mood improved. This happened because I listened to music..",
      "My mood improved. This happened because I did the dishes.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The charity made a goal to raise money. As a result, They fed the homeless..",
      "The charity made a goal to raise money. As a result, They held an auction.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The roller coaster plunged down the steep drop. As a result, The passengers giggled..",
      "The roller coaster plunged down the steep drop. As a result, The passengers screamed.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I was furious. As a result, I checked the mailbox upon leaving the house..",
      "I was furious. As a result, I slammed the door upon leaving the house.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man wanted to watch the sunrise. As a result, He travelled north..",
      "The man wanted to watch the sunrise. As a result, He got up early.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I folded the paper. As a result, I recycled the paper..",
      "I folded the paper. As a result, The paper creased.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The nation endured a natural disaster. As a result, Leaders of other countries formed an alliance..",
      "The nation endured a natural disaster. As a result, Leaders of other countries sent emergency relief.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The boy's clothes got soaked. This happened because He climbed out of the pool..",
      "The boy's clothes got soaked. This happened because He fell into the pool.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The student rushed to finish the book. This happened because It was due to be returned to the library..",
      "The student rushed to finish the book. This happened because He borrowed it from a friend.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The criminal was executed. This happened because He was thrown in jail..",
      "The criminal was executed. This happened because He was convicted of murder.."
    ],
    "answer": 1
  },
  {
    "options": [
      "Sunlight entered the room. This happened because I opened the curtains..",
      "Sunlight entered the room. This happened because I unlocked the door.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I yanked the imposter's hair. As a result, Her wig came off..",
      "I yanked the imposter's hair. As a result, She went bald.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The editor reworded a sentence in the manuscript. This happened because He found the manuscript compelling..",
      "The editor reworded a sentence in the manuscript. This happened because He deemed the sentence unclear.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The woman cancelled her credit card account. This happened because She realized the card was missing..",
      "The woman cancelled her credit card account. This happened because She realized the card was expired.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man and woman fell in love. As a result, They attended college..",
      "The man and woman fell in love. As a result, They got married.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The music was too faint to hear. As a result, I turned up the volume..",
      "The music was too faint to hear. As a result, I composed my own song.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The boy's hair was sticking up. This happened because The girl ruffled it..",
      "The boy's hair was sticking up. This happened because The girl pulled it.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The bug got squashed. This happened because I sprayed myself with bug repellent..",
      "The bug got squashed. This happened because I stepped on the bug.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I opened my eyes. This happened because I woke up..",
      "I opened my eyes. This happened because I relaxed.."
    ],
    "answer": 0
  },
  {
    "options": [
      "My neighbor's music was blaring. As a result, I asked him to turn it down..",
      "My neighbor's music was blaring. As a result, I asked to borrow the CD from him.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man's family lived in poverty. This happened because He was frugal with his earnings..",
      "The man's family lived in poverty. This happened because He earned below minimum wage.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The student graduated from the university. As a result, He looked for a job..",
      "The student graduated from the university. As a result, He took up a hobby.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The artist mixed yellow paint into blue paint. As a result, The paint splattered everywhere..",
      "The artist mixed yellow paint into blue paint. As a result, The paint turned green.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I changed the topic of conversation. This happened because I ran out of things to talk about..",
      "I changed the topic of conversation. This happened because The conversation became tense.."
    ],
    "answer": 1
  },
  {
    "options": [
      "My brother was released from the hospital. As a result, I welcomed him back home..",
      "My brother was released from the hospital. As a result, I gave him the cold shoulder.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The curtain on the stage went up. As a result, The opening scene of the play began..",
      "The curtain on the stage went up. As a result, The actors in the play exited the stage.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The hostage submitted to the kidnapper's mandates. This happened because The kidnapper threatened to hurt the hostage..",
      "The hostage submitted to the kidnapper's mandates. This happened because The kidnapper left the hostage by himself.."
    ],
    "answer": 0
  },
  {
    "options": [
      "A boom reverberated across the stage. This happened because The musician tapped his foot..",
      "A boom reverberated across the stage. This happened because The musician pounded the drum.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The parents rushed to their child's bedroom. This happened because The child awoke screaming from a nightmare..",
      "The parents rushed to their child's bedroom. This happened because The child was scared to look under her bed.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman communicated with sign language. This happened because She was born premature..",
      "The woman communicated with sign language. This happened because She was born deaf.."
    ],
    "answer": 1
  },
  {
    "options": [
      "A drought occurred in the region. As a result, The water became contaminated..",
      "A drought occurred in the region. As a result, The crops perished.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The cat chased the bird. As a result, The bird flew away..",
      "The cat chased the bird. As a result, The bird caught a worm.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The girl switched schools. This happened because School let out for the summer..",
      "The girl switched schools. This happened because She moved to a new town.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The factory owner refused to raise employees' wages. As a result, The owner appointed a new manager..",
      "The factory owner refused to raise employees' wages. As a result, The employees went on strike.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The leader antagonized the extremists among his country. As a result, The extremists influenced him..",
      "The leader antagonized the extremists among his country. As a result, The extremists assassinated him.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I walked barefoot on the beach. As a result, Sand stuck to my feet..",
      "I walked barefoot on the beach. As a result, Waves crashed along the shore.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I woke up in the middle of the night feeling cold. As a result, I put sweatpants on..",
      "I woke up in the middle of the night feeling cold. As a result, I drank a glass of water.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The mother hushed her son. This happened because Her son smirked..",
      "The mother hushed her son. This happened because Her son whined.."
    ],
    "answer": 1
  },
  {
    "options": [
      "A hole ripped in my jeans. This happened because I zipped up the jeans..",
      "A hole ripped in my jeans. This happened because I tripped on the pavement.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The boy wore braces. As a result, He got a cavity..",
      "The boy wore braces. As a result, His teeth became straight.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I worked out at the gym yesterday. As a result, I woke up today with sore muscles..",
      "I worked out at the gym yesterday. As a result, I woke up today with a sore throat.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The girl whispered back and forth to each other at the lunch table. As a result, Other students sat down at the lunch table..",
      "The girl whispered back and forth to each other at the lunch table. As a result, Other students at the lunch table felt left out.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The child landed on the trampoline. As a result, She sprung back up into the air..",
      "The child landed on the trampoline. As a result, She decided to try to do a flip.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I deposited the letter in the mailbox. As a result, The post office delivered the letter..",
      "I deposited the letter in the mailbox. As a result, The post office expedited the letter.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The gambler was confident. As a result, He bet all of his money..",
      "The gambler was confident. As a result, He went home broke.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The forest fire spread. This happened because The winds became stronger..",
      "The forest fire spread. This happened because The arsonists were apprehended.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The child skinned his knee. As a result, His mother sent him to his room..",
      "The child skinned his knee. As a result, His mother put a bandage on the wound.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man survived the deadly illness. This happened because He signed his will..",
      "The man survived the deadly illness. This happened because He received an organ transplant.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I took a sip of the scalding coffee. As a result, I bit my tongue..",
      "I took a sip of the scalding coffee. As a result, I burnt my tongue.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The editor fired the writer. This happened because The writer avoided bias in her stories..",
      "The editor fired the writer. This happened because The writer missed an important deadline.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I felt exhausted. This happened because I slept all day..",
      "I felt exhausted. This happened because I studied all day.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The physician diagnosed the patient. This happened because She identified the patient's symptoms..",
      "The physician diagnosed the patient. This happened because She prescribed pills to the patient.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I scratched my skin. This happened because It was sweaty..",
      "I scratched my skin. This happened because It felt itchy.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man underwent emergency surgery. This happened because He lost his temper..",
      "The man underwent emergency surgery. This happened because He suffered a heart attack.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man's arm muscles bulged. This happened because He flexed his arms..",
      "The man's arm muscles bulged. This happened because He rubbed his arms.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man raised his eyebrows. This happened because He was surprised..",
      "The man raised his eyebrows. This happened because He felt discouraged.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I excused my colleague's blunder. This happened because I believed his intentions were good..",
      "I excused my colleague's blunder. This happened because I believed that he knew better.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man quit smoking. As a result, He began exercising more..",
      "The man quit smoking. As a result, He started waking up earlier.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman punched her attacker in the nose. As a result, The attacker's body went lifeless..",
      "The woman punched her attacker in the nose. As a result, The attacker started to bleed.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The dart missed the bull's eye. This happened because The man's aim was off..",
      "The dart missed the bull's eye. This happened because The man was losing the game.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The homeowner requested that an exterminator come to his house. This happened because He discovered rats in the basement..",
      "The homeowner requested that an exterminator come to his house. This happened because He kept an ant farm in his room.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I suggested to my houseguest that we go out to dinner. This happened because I was too tired to prepare anything..",
      "I suggested to my houseguest that we go out to dinner. This happened because My houseguest overstayed her welcome.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The girl caught her brother reading her diary. As a result, She started hiding the diary..",
      "The girl caught her brother reading her diary. As a result, She got a new diary.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman was short on money for rent. As a result, She worked overtime..",
      "The woman was short on money for rent. As a result, She quit her job.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The child's hand quickly recoiled. This happened because He touched the hot stove..",
      "The child's hand quickly recoiled. This happened because He patted the puppy's head.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The company wanted to gauge customer satisfaction. As a result, They offered a discount to new customers..",
      "The company wanted to gauge customer satisfaction. As a result, They distributed a survey to customers.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The wood floor became scratched. This happened because The boy threw the cushions off the couch..",
      "The wood floor became scratched. This happened because The boy dragged a chair across the floor.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I shielded my face. This happened because My enemy taunted me..",
      "I shielded my face. This happened because My enemy cocked a fist.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The famous statue burned down. This happened because It was struck by lightning..",
      "The famous statue burned down. This happened because People came to venerate it.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I left the fruit out on the table. As a result, The fruit shed seeds..",
      "I left the fruit out on the table. As a result, Flies swarmed the fruit.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The ballerina tore a ligament. This happened because She pointed her toes..",
      "The ballerina tore a ligament. This happened because She twisted her ankle.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The child's shoelaces came untied. This happened because He learned how to tie them..",
      "The child's shoelaces came untied. This happened because He ran around on the playground.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I became enthralled in the book. As a result, I returned the book..",
      "I became enthralled in the book. As a result, I lost track of time.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man held similar beliefs to those of his parents. This happened because His parents influenced him..",
      "The man held similar beliefs to those of his parents. This happened because His parents disowned him.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The car gradually slowed to a stop. This happened because It ran out of gas..",
      "The car gradually slowed to a stop. This happened because The driver fell asleep.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man ate the ice cream in the sun. As a result, The ice cream lost its flavor..",
      "The man ate the ice cream in the sun. As a result, The ice cream dripped from the cone.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I hung artwork in the room. This happened because The carpet looked dirty..",
      "I hung artwork in the room. This happened because The walls looked bare.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I left work early. This happened because I had a headache..",
      "I left work early. This happened because My boss held a meeting.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The puppy soiled the carpet. As a result, The owner scolded the puppy..",
      "The puppy soiled the carpet. As a result, The owner gave the puppy a treat.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I apologized to my friend. As a result, My friend forgave me..",
      "I apologized to my friend. As a result, My friend became infuriated.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man stood out in the crowd. This happened because He carried a backpack..",
      "The man stood out in the crowd. This happened because He wore a neon vest.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The witness lied under oath. As a result, He completed his testimony..",
      "The witness lied under oath. As a result, He was charged with perjury.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The woman dyed her hair. This happened because She wanted a new look..",
      "The woman dyed her hair. This happened because She wanted to blend in.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The immigrants were caught illegally residing in the country. As a result, They found employment..",
      "The immigrants were caught illegally residing in the country. As a result, They were deported.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The public speaker cracked a joke. As a result, The audience laughed..",
      "The public speaker cracked a joke. As a result, The audience stood up.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I looked into the sun. As a result, The sun blinded me..",
      "I looked into the sun. As a result, The sun tanned my skin.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I felt bored. As a result, I snorted..",
      "I felt bored. As a result, I yawned.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The steak was difficult to cut. This happened because The knife was dull..",
      "The steak was difficult to cut. This happened because The steak was raw.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman declared bankruptcy. This happened because She received alimony payment..",
      "The woman declared bankruptcy. This happened because She acquired massive debt.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The lights in my friend's apartment were on. As a result, I wondered if he was out..",
      "The lights in my friend's apartment were on. As a result, I decided to pay him a visit.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I put the flower under my nose. As a result, The petals came off the flower..",
      "I put the flower under my nose. As a result, I picked up the flower's scent.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The woman felt nostalgic. This happened because She ran into a childhood friend..",
      "The woman felt nostalgic. This happened because She yelled at her children.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The student procrastinated on the paper. As a result, He submitted the paper early..",
      "The student procrastinated on the paper. As a result, He submitted the paper incomplete.."
    ],
    "answer": 1
  },
  {
    "options": [
      "My car broke down. As a result, I went to the mall..",
      "My car broke down. As a result, I called a mechanic.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I discarded the note. This happened because It was anonymous..",
      "I discarded the note. This happened because It was illegible.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The bird flapped its wings. As a result, It laid eggs..",
      "The bird flapped its wings. As a result, It ascended upwards.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I parked in the driveway. This happened because The garage was open..",
      "I parked in the driveway. This happened because The garage was full.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The criminal aimed the gun at his victim. As a result, The criminal put down the gun..",
      "The criminal aimed the gun at his victim. As a result, The victim put his hands up.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I looked forward to the weekend. This happened because I planned to attend my uncle's funeral..",
      "I looked forward to the weekend. This happened because I planned to attend my friend's wedding.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I lost track of time. This happened because I was daydreaming..",
      "I lost track of time. This happened because I was nauseous.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The document printed out illegibly. This happened because The printer was low on ink..",
      "The document printed out illegibly. This happened because The print was out of paper.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The stadium played the national anthem. As a result, The fans turned to the flag..",
      "The stadium played the national anthem. As a result, The fans rushed the field.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The dip tasted bland. As a result, I served it..",
      "The dip tasted bland. As a result, I put salt in it.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I set the paper towel on the spill. As a result, The towel absorbed the liquid..",
      "I set the paper towel on the spill. As a result, The spill left a sticky residue.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman was interrupted in the midst of reading her book. As a result, She bookmarked her page..",
      "The woman was interrupted in the midst of reading her book. As a result, She reread the book.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The plane hit some turbulence. As a result, The man tightened his seatbelt..",
      "The plane hit some turbulence. As a result, The man looked out the window.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The boy flinched. This happened because The girl ignored him..",
      "The boy flinched. This happened because The girl poked him.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The doctors gave the patient an artificial limb. This happened because They amputated her leg..",
      "The doctors gave the patient an artificial limb. This happened because They monitored her vitals.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The boy pinched the girl's elbow. As a result, She shrugged her shoulders at him..",
      "The boy pinched the girl's elbow. As a result, She jerked her arm away from him.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I asked my friend for advice. This happened because I valued his opinion..",
      "I asked my friend for advice. This happened because I knew I was right.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The boy stepped in mud. As a result, The mud stuck to his shoes..",
      "The boy stepped in mud. As a result, The mud hit him in the face.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The town received several inches of snow. As a result, Schools shut down..",
      "The town received several inches of snow. As a result, People hid underground.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The employee's shift ended. As a result, He went home for the day..",
      "The employee's shift ended. As a result, He threatened to quit the job.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The tree damaged the house. This happened because The tree fell onto the roof..",
      "The tree damaged the house. This happened because The tree shaded the backyard.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The wood split in half. This happened because I stacked the wood in the fireplace..",
      "The wood split in half. This happened because I swung the axe down to the wood.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The family congratulated the couple. This happened because The couple announced that they were separating..",
      "The family congratulated the couple. This happened because The couple announced that they were having a baby.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The girl sent the boy a valentine. This happened because She liked him..",
      "The girl sent the boy a valentine. This happened because She kissed him.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I nodded my head at my friend's statement. This happened because I was confused..",
      "I nodded my head at my friend's statement. This happened because I agreed with him.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The friends flipped a coin. This happened because They wanted to find a compromise..",
      "The friends flipped a coin. This happened because They wanted to make a fair decision.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The timer in the kitchen went off. As a result, The man unloaded the groceries into the refrigerator..",
      "The timer in the kitchen went off. As a result, The man took the pizza out of the oven.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The woman set an ambitious goal. As a result, She slacked off..",
      "The woman set an ambitious goal. As a result, She worked hard.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The wealthy man died of old age. As a result, His son got into legal trouble..",
      "The wealthy man died of old age. As a result, His son inherited his fortune.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The woman stomped on the flames. As a result, The flames went out..",
      "The woman stomped on the flames. As a result, Smoke arose from the flames.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman's car was in the shop. This happened because Her driver's license was revoked..",
      "The woman's car was in the shop. This happened because She got in a car accident.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I slept through my alarm. As a result, I made breakfast..",
      "I slept through my alarm. As a result, I missed breakfast.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The public figure got out of the limousine. As a result, Cameras flashed in his direction..",
      "The public figure got out of the limousine. As a result, His family attended the press conference.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman lingered in the bathtub. As a result, The bathwater became lukewarm..",
      "The woman lingered in the bathtub. As a result, The bathwater drained out of the tub.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The college student wanted to meet other students on campus. As a result, He joined a fraternity..",
      "The college student wanted to meet other students on campus. As a result, He majored in engineering.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I lifted up the couch cushions. This happened because I was looking for loose change..",
      "I lifted up the couch cushions. This happened because I was rearranging the living room.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The wasp flew towards the boy. As a result, The boy ran away..",
      "The wasp flew towards the boy. As a result, The boy picked a flower.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman was found guilty of a misdemeanor. As a result, She was sentenced to perform community service..",
      "The woman was found guilty of a misdemeanor. As a result, She was put on death row.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I stirred the sugar into the hot tea. As a result, The tea steamed..",
      "I stirred the sugar into the hot tea. As a result, The sugar dissolved.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The veteran walked with a limp. This happened because He was drafted for the war..",
      "The veteran walked with a limp. This happened because He was injured in battle.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The criminal ran away from the police. As a result, The police attended to the victim..",
      "The criminal ran away from the police. As a result, The police chased the criminal.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The laptop wouldn't turn on. This happened because I dropped it..",
      "The laptop wouldn't turn on. This happened because I charged it.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman ran out of room in her closet. This happened because She acquired an extensive wardrobe..",
      "The woman ran out of room in her closet. This happened because She folded her laundry.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man was heartbroken. This happened because His wife gave birth..",
      "The man was heartbroken. This happened because His wife left him.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man obtained a degree. As a result, He became qualified for the job he wanted..",
      "The man obtained a degree. As a result, His job offer was rescinded.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man's voice projected clearly throughout the auditorium. This happened because He greeted the audience..",
      "The man's voice projected clearly throughout the auditorium. This happened because He spoke into the microphone.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I tossed a coin into the fountain of water. As a result, The coin sunk to the bottom..",
      "I tossed a coin into the fountain of water. As a result, The coin broke in half.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The player hit the ball toward the hole. As a result, The ball went in the hole..",
      "The player hit the ball toward the hole. As a result, The ball retreated back to the player.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I breathed in the dust in the attic. As a result, I hiccupped..",
      "I breathed in the dust in the attic. As a result, I sneezed.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The store cashier called security. This happened because The customer used counterfeit money..",
      "The store cashier called security. This happened because The customer left his headlights on.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I took the garbage out. This happened because The garbage made the kitchen smell bad..",
      "I took the garbage out. This happened because I accidentally threw away my shopping list.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The family went to the zoo. As a result, The children admired the animals..",
      "The family went to the zoo. As a result, The children chased the animals.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man's breathing was loud. This happened because His kidneys were failing..",
      "The man's breathing was loud. This happened because His lungs were congested.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I had an extra ticket for the concert. As a result, I asked my friend for directions to the venue..",
      "I had an extra ticket for the concert. As a result, I asked my friend if he was interested in going.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The air conditioner in the house broke. As a result, I brought out blankets..",
      "The air conditioner in the house broke. As a result, I opened the windows.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The boy's back ached. This happened because His backpack was open..",
      "The boy's back ached. This happened because His backpack was heavy.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I bought my mother a present. This happened because I baked her a cake..",
      "I bought my mother a present. This happened because It was her birthday.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The daffodils in the garden were destroyed. This happened because A bee stung the gardener..",
      "The daffodils in the garden were destroyed. This happened because Squirrels dug up the bulbs.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I struck the match. As a result, The flame faded out..",
      "I struck the match. As a result, The match produced a flame.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The disputing parties reached a settlement. This happened because They didn't want to debate in court..",
      "The disputing parties reached a settlement. This happened because They wanted to repair their personal relationship.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The children were sent to an orphanage. This happened because Their parents died..",
      "The children were sent to an orphanage. This happened because Their parents spoiled them.."
    ],
    "answer": 0
  },
  {
    "options": [
      "A meteorite landed in the ocean. As a result, A tsunami occurred..",
      "A meteorite landed in the ocean. As a result, It began to hail.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The hiker encountered a poisonous snake. As a result, She became dehydrated..",
      "The hiker encountered a poisonous snake. As a result, She panicked.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The oven became hot. This happened because I turned the oven on..",
      "The oven became hot. This happened because I put the dish in the oven.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I squeezed the lemon wedge. As a result, The lemon got moldy..",
      "I squeezed the lemon wedge. As a result, The lemon squirted.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The country discovered new land. As a result, The country abandoned the land..",
      "The country discovered new land. As a result, The country colonized the land.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The glass toppled off the table. As a result, It shattered all over the floor..",
      "The glass toppled off the table. As a result, It landed in a pile of laundry.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The table wobbled. This happened because The floor was uneven..",
      "The table wobbled. This happened because The floor was slippery.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The father caught his son lying. As a result, His son confessed the truth..",
      "The father caught his son lying. As a result, The father trusted his son.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man's head throbbed with pain. As a result, He took cough syrup..",
      "The man's head throbbed with pain. As a result, He took aspirin.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The train slowed down. This happened because It was approaching the station..",
      "The train slowed down. This happened because It was running behind schedule.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man went through therapy. This happened because Mental illness ran in his family..",
      "The man went through therapy. This happened because He was diagnosed with depression.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The woman clutched her throat. This happened because She swallowed her food..",
      "The woman clutched her throat. This happened because She choked on her food.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The woman had a sore throat. As a result, Her voice sounded raspy..",
      "The woman had a sore throat. As a result, She spoke with an accent.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The dog eyed the juicy steak on the table. As a result, It drooled..",
      "The dog eyed the juicy steak on the table. As a result, It laid down.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman's business succeeded. As a result, She fired her employees..",
      "The woman's business succeeded. As a result, She became wealthy.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The students exited the classroom. This happened because The bell rang..",
      "The students exited the classroom. This happened because The teacher assigned homework.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman claimed she saw a ghost. As a result, Her acquaintances expressed skepticism..",
      "The woman claimed she saw a ghost. As a result, Her acquaintances related to her.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man lost his hearing. This happened because He nearly drowned in the ocean..",
      "The man lost his hearing. This happened because He was nearly killed in an explosion.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The child let go of the balloon string. As a result, The balloon deflated..",
      "The child let go of the balloon string. As a result, The balloon rose into the air.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man lost his ability to speak. This happened because He had a stroke..",
      "The man lost his ability to speak. This happened because He took a deep breath.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The woman tripped on the sidewalk. This happened because There was a crack in the cement..",
      "The woman tripped on the sidewalk. This happened because She heard her name being called.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man did a canon ball into the pool. As a result, The lifeguard jumped in after him..",
      "The man did a canon ball into the pool. As a result, The man soaked the lifeguard.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I took antibiotics. As a result, My infection cleared up..",
      "I took antibiotics. As a result, My infection spread.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The traffic light turned yellow. As a result, The driver pushed the brake..",
      "The traffic light turned yellow. As a result, The driver honked his horn.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The plastic container melted. This happened because I soaked the container in warm water..",
      "The plastic container melted. This happened because I placed the container on the hot stove.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The car got dented. This happened because The driver hit a telephone pole..",
      "The car got dented. This happened because The driver ran a red light.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The boy studied all night. As a result, He skipped the exam..",
      "The boy studied all night. As a result, He passed the exam.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The young boy clung to the ledge of the pool. This happened because He feared learning to swim..",
      "The young boy clung to the ledge of the pool. This happened because The lifeguard was on duty.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I put my hand to my chest. As a result, I felt my heartbeat..",
      "I put my hand to my chest. As a result, My heart rate sped up.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The building adjacent to my office was under construction. As a result, My office was crowded..",
      "The building adjacent to my office was under construction. As a result, My office was noisy.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The family wanted to get to know their new neighbors. As a result, The family invited the neighbors over for dinner..",
      "The family wanted to get to know their new neighbors. As a result, The family waved to the neighbors from their yard.."
    ],
    "answer": 0
  },
  {
    "options": [
      "Water splashed up from the pool. This happened because The swimmer dove into the pool..",
      "Water splashed up from the pool. This happened because The swimmer floated in the pool.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I bit into a slice of watermelon. As a result, I accidentally swallowed a seed..",
      "I bit into a slice of watermelon. As a result, I accidentally chipped my tooth.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The boy tripped. This happened because His jacket was unzipped..",
      "The boy tripped. This happened because His shoelaces were untied.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The woman put earplugs in. This happened because She was distracted by noise..",
      "The woman put earplugs in. This happened because She got her ears pierced.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I refilled my water bottle. This happened because I drank all the water in it..",
      "I refilled my water bottle. This happened because I kept it in the fridge.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The television show was censored. This happened because It contained vulgar language..",
      "The television show was censored. This happened because It had a complicated plot.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The ship wrecked. As a result, The crew drowned..",
      "The ship wrecked. As a result, The crew encountered pirates.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The boy felt stumped by the riddle. As a result, He solved the riddle..",
      "The boy felt stumped by the riddle. As a result, He requested a hint.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The phone rang. As a result, The man hung up the phone..",
      "The phone rang. As a result, The man picked up the phone.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The woman was staring at me. As a result, I hugged her..",
      "The woman was staring at me. As a result, I felt uncomfortable.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The group left the museum. This happened because They took pictures of the exhibits..",
      "The group left the museum. This happened because They viewed all the exhibits.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man started an argument with me. As a result, My friend introduced me to the man..",
      "The man started an argument with me. As a result, My friend stood up for me.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The tire on my bike was flat. As a result, I pumped air into the tire..",
      "The tire on my bike was flat. As a result, I switched gears on the bike.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The girl looked pale. As a result, Her father read her a story..",
      "The girl looked pale. As a result, Her father felt her forehead.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The pen ran out of ink. As a result, I used a pencil..",
      "The pen ran out of ink. As a result, I signed my name.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man was denied for a loan. This happened because He was in debt..",
      "The man was denied for a loan. This happened because He started a business.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The girl stayed home from school. This happened because She had chicken pox..",
      "The girl stayed home from school. This happened because She enjoyed learning math.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The trash bag was full. As a result, I took it to the dumpster..",
      "The trash bag was full. As a result, I dumped it down the sink.."
    ],
    "answer": 0
  },
  {
    "options": [
      "I vacuumed the carpet. This happened because My roommate spilled punch..",
      "I vacuumed the carpet. This happened because My dog shed hair.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man lost his temper. As a result, He turned off his computer..",
      "The man lost his temper. As a result, He threw a chair across the room.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The girl threw a twig into the campfire. As a result, The twig burned..",
      "The girl threw a twig into the campfire. As a result, The fire went out.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man got out of the shower. This happened because The hot water was gone..",
      "The man got out of the shower. This happened because He couldn't find a towel.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The parents wanted their children to go to college. As a result, They set aside a savings fund for tuition..",
      "The parents wanted their children to go to college. As a result, They encouraged their children to play outside.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man unlaced his shoes. As a result, The shoes loosened..",
      "The man unlaced his shoes. As a result, The shoes became worn.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man ate half of the entree. As a result, He refrigerated the leftovers..",
      "The man ate half of the entree. As a result, He saved the recipe.."
    ],
    "answer": 0
  },
  {
    "options": [
      "My ankle was swollen. As a result, I put ice on it..",
      "My ankle was swollen. As a result, I rubbed lotion on it.."
    ],
    "answer": 0
  },
  {
    "options": [
      "My office door was open. As a result, I talked to my colleague at my desk..",
      "My office door was open. As a result, I overheard the conversation in the hall.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I had to wait in line. As a result, I took a seat..",
      "I had to wait in line. As a result, I skimmed a magazine.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The man swatted at the fly. As a result, The fly buzzed away..",
      "The man swatted at the fly. As a result, The fly stayed still.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man wrote a will. This happened because He was dying..",
      "The man wrote a will. This happened because He was a widower.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The runner sensed his competitor gaining on him. As a result, He dropped out of the race..",
      "The runner sensed his competitor gaining on him. As a result, He sped up his pace.."
    ],
    "answer": 1
  },
  {
    "options": [
      "I thought carefully about the problem. As a result, I asked for advice..",
      "I thought carefully about the problem. As a result, I came up with a solution.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The traveler walked on the shaky suspension bridge. As a result, He felt terrified..",
      "The traveler walked on the shaky suspension bridge. As a result, He felt ecstatic.."
    ],
    "answer": 0
  },
  {
    "options": [
      "The man anticipated the team's victory. As a result, He met his friends to watch the game..",
      "The man anticipated the team's victory. As a result, He made a bet with his friends.."
    ],
    "answer": 1
  },
  {
    "options": [
      "The boy couldn't fall asleep. As a result, He set his alarm clock..",
      "The boy couldn't fall asleep. As a result, He counted sheep.."
    ],
    "answer": 1
  }
]